spec/cassettes/User_Makes_Payment/valid_user_info_and_valid_payment_info.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: email=joe%40gmail.com&card=tok_15h29lKoSw2hrlQej9YkU8p4&plan=regular
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.20.1
      Authorization:
      - Bearer sk_test_xfU7xy3kwkAkXxGSIv1kRs8S
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.20.1","lang":"ruby","lang_version":"2.1.4 p265 (2014-10-27)","platform":"i686-linux","publisher":"stripe","uname":"Linux
        eduardo-Inspiron-3537 3.13.0-46-generic #79-Ubuntu SMP Tue Mar 10 20:08:14
        UTC 2015 i686 i686 i686 GNU/Linux"}'
      Content-Length:
      - '68'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 16 Mar 2015 17:37:39 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2323'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_ayMvCfxMUBeAejZq
      Stripe-Version:
      - '2015-02-18'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1426527458,
          "id": "cus_5snlatPqqpk9Dk",
          "livemode": false,
          "description": null,
          "email": "joe@gmail.com",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_5snlatPqqpk9Dk/subscriptions",
            "data": [
              {
                "id": "sub_5snlOrJDkt0w6k",
                "plan": {
                  "interval": "month",
                  "name": "Myflix regular subscription",
                  "created": 1426518765,
                  "amount": 999,
                  "currency": "usd",
                  "id": "regular",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_descriptor": "Myflix fee"
                },
                "object": "subscription",
                "start": 1426527458,
                "status": "active",
                "customer": "cus_5snlatPqqpk9Dk",
                "cancel_at_period_end": false,
                "current_period_start": 1426527458,
                "current_period_end": 1429205858,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null,
                "tax_percent": null,
                "metadata": {}
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "sources": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_5snlatPqqpk9Dk/sources",
            "data": [
              {
                "id": "card_15h29lKoSw2hrlQes0aOJUTR",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 7,
                "exp_year": 2017,
                "fingerprint": "yVufS9dNGxll2kqT",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_5snlatPqqpk9Dk"
              }
            ]
          },
          "default_source": "card_15h29lKoSw2hrlQes0aOJUTR"
        }
    http_version: 
  recorded_at: Mon, 16 Mar 2015 17:37:39 GMT
recorded_with: VCR 2.9.3
